using System;
using System.ComponentModel.Design;
class program()
{
    static void Main()
    {
        // умовні конструкції
         Console.WriteLine("Введіть число 5 ");
        int user = Convert.ToInt32(Console.ReadLine());
        bool ishascar;
        // if else це умовна конструкція. Вони проводять перевірку на виконання умови.
        // якщо умова виконується то виконується перший блок коду, якщо не виконується то другий блок коду
        // є наступні типи перевірки if, if else, if else if, switch.
        // if - перевірка на виконання умови
        // if else - перевірка на виконання умови, якщо умова не виконується то виконується інший блок коду
        // if else if - перевірка на виконання умови, якщо умова не виконується то перевіряється інша умова
        // switch - перевірка на виконання умови, якщо умова виконується то виконується блок коду
        // є наступні умови перевірки == це рівність, != це нерівність, > більше, < менше, >= більше або рівне, <= менше або рівне
        // && - логічне І, || - логічне АБО
        if (user <= 5) // якщо число менше або рівне 5 то виконується перший блок коду
        {
            ishascar = true; // змінна ishascar = true
        }
        else // якщо число більше 5 то виконується другий блок коду
        {
            ishascar = false;
        }
        if (!ishascar)
        {
            Console.WriteLine("Ви ввели число більше 5");
        }
        else
        {
            Console.WriteLine("Ви ввели число менше 5");
        }
        //switch - це умовна конструкція, яка виконується якщо виконується умова
        // default - це умова яка виконується якщо не виконується жодна умова
        Console.WriteLine("Введіть число 1");
        short user_input = Convert.ToInt16(Console.ReadLine());

        switch (user_input)
        {
            case 1:
                Console.WriteLine("Ви ввели число 1"); 
                break;
            default:
                Console.WriteLine("Ви ввели число не 1");
                break;
        }
    }
}