using System;
namespace Cycles;
    class Program
{
    static void Main(string[] args)
    {
        // цикли це конструкції які дозволяють виконувати один і той же код декілька разів
        // є наступні види циклів: for - цикл з лічильником тобто цикл який виконується певну кількість разів,
        // while - цикл з передумовою тобто цикл який виконується поки виконується певна умова, do while - цикл з постумовою тобто цикл який виконується поки виконується певна умова але він виконується хоча б один раз
        // foreach - цикл який використовується для перебору колекцій, колекції це масиви, списки, словники і т.д. іх ми розглянемо пізніше
        for (int i = 0; i < 10; i++) // перша умова це початкове значення лічильника, друга умова це умова при якій цикл буде виконуватися, третя умова це крок лічильника
                                     // в даному випадку цикл буде виконуватися поки i < 10, крок лічильника 1
        {
            Console.WriteLine(i);
        }
        bool userdata = false;
        while (!userdata) // цикл буде виконуватися поки userdata == false
        {
            Console.WriteLine("Enter your name: "); // команда яка виводить текст на екран
            string name = Console.ReadLine(); // команда яка зчитує введені дані з клавіатури
            if (name == "exit") // якщо введене слово exit то цикл завершиться
            {
                userdata = true; // змінюємо значення змінної на true
            }
        }
        int a = 1;
        do // цикл буде виконуватися хоча б один раз навіть якщо умова не виконується
        {
            a++;
        }
        while (a < 10); // це умова, цикл буде виконуватися поки a < 10
    }
}