using System;
using System.Globalization;
class Data_Arrays 
{
    // тема: масиви
    // масиви - це структура даних, яка дозволяє зберігати велику кількість однотипних даних
    // масиви в C# можуть бути одновимірними, багатовимірними, зубчастими
    // одновимірний масив - це масив, який містить один рядок елементів
    // багатовимірний масив - це масив, який містить багато рядків елементів
    // зубчастий масив - це масив, який містить одновимірні масиви
    static void Main()
    {
        int[] nums = new int[5]; // тут ми створюємо масив nums, який містить 5 елементів типу int, після "=" слово "new" вказує на створення нового об'єкта
                                 // класу int, а слово "int" вказує на тип даних, який містить масив з 5 елементів
        nums[0] = 1;             // тут ми звертаємось до першого елемента масиву nums і присвоюємо йому значення 1 і так далі
        nums[1] = 3;
        nums[2] = 6;
        nums[3] = 8;
        nums[4] = 3;

        nums[3] += 56;          // тут ми збільшуємо значення третього елемента масиву nums на 56
        Console.WriteLine(nums[3]);

        string[] names = {"andrey", "Jotharo", "Polnaref"}; // тут ми створюємо масив names, який містить 3 елементи типу string
        names[0] = "Dio";                                   // дана строка змінює перший елемент масиву names на "Dio"
        Console.WriteLine(names[0]);

        for (int i = 0; i <= names.Length; i++)             // цикл for використовується для перебору всіх елементів масиву names
            Console.WriteLine("El :" + nums[i]);

        short[] numbers = new short[10];

        short sum = 0;

        Random random = new Random(); // клас Random використовується для генерації випадкових чисел

        for (int i = 0; i < numbers.Length; i++)
        {
            numbers[i] = Convert.ToInt16(random.Next(0, 100)); // метод Next класу Random генерує випадкове число в діапазоні від 0 до 100
            Console.WriteLine(numbers[i]);

            sum += numbers[i];
        }
        Console.WriteLine("Suma of random numbers: " + sum);


        // багатовимірний масив
        char[,] nums2 = new char[3, 3]; // тут ми створюємо багатовимірний масив nums2, який містить 3 рядки і 3 стовпці
        nums2[0, 0] = 'h';              // тут ми звертаємось до першого рядка і першого стовпця масиву nums2 і присвоюємо йому значення 'h'
                                        // далі ми можемо присвоювати значення іншим елементам масиву nums2 по стовпцям і рядкам які тут не вказані
                                        // але вони є в пам'яті масуву nums2

        int[,] matrix = {               // тут ми створюємо багатовимірний масив matrix, який містить 3 рядки і 3 стовпці і відразу присвоюємо йому значення
        {1, 2, 3},                      // тут це зображено як матриця
        {4, 5, 6},                      // тобто кожен рядок це окремий масив з вже вказаними елементами
        {7, 8, 9}
        };


    }
}
